---
kind: type
id: T:Autodesk.Revit.DB.SpecTypeId
source: html/35c5a3db-b4b3-daa0-ebdd-ae87d03cd5bb.htm
---
# Autodesk.Revit.DB.SpecTypeId

This class contains constants identifying specs.

## Syntax (C#)
```csharp
public static class SpecTypeId
```